jemter/k8s-business.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.4.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="容器调用链路" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="用户定义的变量" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="ngIp" elementType="Argument">
            <stringProp name="Argument.name">ngIp</stringProp>
            <stringProp name="Argument.value">10.10.101.128</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="ngPort" elementType="Argument">
            <stringProp name="Argument.name">ngPort</stringProp>
            <stringProp name="Argument.value">38080</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="bopIp" elementType="Argument">
            <stringProp name="Argument.name">bopIp</stringProp>
            <stringProp name="Argument.value">bop-svc</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="bopPort" elementType="Argument">
            <stringProp name="Argument.name">bopPort</stringProp>
            <stringProp name="Argument.value">8080</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="gatewayIp" elementType="Argument">
            <stringProp name="Argument.name">gatewayIp</stringProp>
            <stringProp name="Argument.value">gateway-svc</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="gatewayPort" elementType="Argument">
            <stringProp name="Argument.name">gatewayPort</stringProp>
            <stringProp name="Argument.value">8080</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="cronIp" elementType="Argument">
            <stringProp name="Argument.name">cronIp</stringProp>
            <stringProp name="Argument.value">cron-svc</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="cronPort" elementType="Argument">
            <stringProp name="Argument.name">cronPort</stringProp>
            <stringProp name="Argument.value">8080</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="riskIp" elementType="Argument">
            <stringProp name="Argument.name">riskIp</stringProp>
            <stringProp name="Argument.value">risk-svc</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="riskPort" elementType="Argument">
            <stringProp name="Argument.name">riskPort</stringProp>
            <stringProp name="Argument.value">8080</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="coreIp" elementType="Argument">
            <stringProp name="Argument.name">coreIp</stringProp>
            <stringProp name="Argument.value">core-svc</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="corePort" elementType="Argument">
            <stringProp name="Argument.name">corePort</stringProp>
            <stringProp name="Argument.value">8080</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="dataIp" elementType="Argument">
            <stringProp name="Argument.name">dataIp</stringProp>
            <stringProp name="Argument.value">data-svc</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="dataPort" elementType="Argument">
            <stringProp name="Argument.name">dataPort</stringProp>
            <stringProp name="Argument.value">8080</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="rocketmqIp" elementType="Argument">
            <stringProp name="Argument.name">rocketmqIp</stringProp>
            <stringProp name="Argument.value">rocketmq-svc</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="rocketmqPort" elementType="Argument">
            <stringProp name="Argument.name">rocketmqPort</stringProp>
            <stringProp name="Argument.value">8080</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="init" enabled="false">
        <stringProp name="ThreadGroup.on_sample_error">stoptestnow</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="循环控制器" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="json头 管理参数" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json;charset=UTF-8</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="nginx配置更新" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;mysql_resp_interval&quot;: &quot;-1&quot;,&#xd;
    &quot;get_http_url1&quot;: &quot;http://${gatewayIp}:${gatewayPort}/bookDemo/gateway/practice/httpTxn1&quot;,&#xd;
    &quot;get_http_url2&quot;: &quot;http://${gatewayIp}:${gatewayPort}/bookDemo/gateway/practice/httpTxn1&quot;,&#xd;
    &quot;get_http_url3&quot;: &quot;http://${gatewayIp}:${gatewayPort}/bookDemo/gateway/practice/httpTxn1&quot;,&#xd;
    &quot;get_http_url4&quot;: &quot;http://${gatewayIp}:${gatewayPort}/bookDemo/gateway/practice/httpTxn2And4&quot;,&#xd;
    &quot;http_error_resp_code&quot;: &quot;200&quot;,&#xd;
    &quot;http_resp_interval&quot;: &quot;10&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${ngIp}</stringProp>
          <stringProp name="HTTPSampler.port">${ngPort}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">bookDemo/nginx/practice/updateConfig</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.implementation">Java</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP 更新gateway-svc配置" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;httpType&quot;: &quot;POST&quot;,&#xd;
  &quot;urlAddr&quot;: &quot;http://${gatewayIp}:${gatewayPort}/bookDemo/gateway/practice/updateConfig&quot;,&#xd;
  &quot;arams&quot;: { &#xd;
    &quot;mysql_resp_interval&quot;: &quot;-1&quot;,&#xd;
    &quot;get_http_url1&quot;: &quot;http://${bopIp}:${bopPort}/bookDemo/bop/practice/httpTxn2And4&quot;,&#xd;
    &quot;get_http_url2&quot;: &quot;http://${bopIp}:${bopPort}/bookDemo/bop/practice/httpTxn2And4&quot;,&#xd;
    &quot;get_http_url3&quot;: &quot;http://${bopIp}:${bopPort}/bookDemo/bop/practice/httpTxn1&quot;,&#xd;
    &quot;get_http_url4&quot;: &quot;http://${bopIp}:${bopPort}/bookDemo/bop/practice/httpTxn1&quot;,&#xd;
    &quot;http_error_resp_code&quot;: &quot;200&quot;,&#xd;
    &quot;http_resp_interval&quot;: &quot;15&quot;&#xd;
  }&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${ngIp}</stringProp>
          <stringProp name="HTTPSampler.port">${ngPort}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">bookDemo/chain/chainDTO</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.implementation">Java</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP 更新bop-svc配置" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;httpType&quot;: &quot;POST&quot;,&#xd;
  &quot;urlAddr&quot;: &quot;http://${bopIp}:${bopPort}/bookDemo/bop/practice/updateConfig&quot;,&#xd;
  &quot;arams&quot;: { &#xd;
    &quot;mysql_resp_interval&quot;: &quot;-1&quot;,&#xd;
    &quot;get_http_url1&quot;: &quot;http://${cronIp}:${cronPort}/bookDemo/cron/practice/httpTxn1&quot;,&#xd;
    &quot;get_http_url2&quot;: &quot;http://${cronIp}:${cronPort}/bookDemo/cron/practice/httpTxn1&quot;,&#xd;
    &quot;get_http_url3&quot;: &quot;http://${cronIp}:${cronPort}/bookDemo/cron/practice/httpSuccess&quot;,&#xd;
    &quot;get_http_url4&quot;: &quot;http://${coreIp}:${corePort}/bookDemo/core/practice/httpTxn1&quot;,&#xd;
    &quot;http_error_resp_code&quot;: &quot;200&quot;,&#xd;
    &quot;http_resp_interval&quot;: &quot;15&quot;&#xd;
  }&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${ngIp}</stringProp>
          <stringProp name="HTTPSampler.port">${ngPort}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">bookDemo/chain/chainDTO</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.implementation">Java</stringProp>
          <stringProp name="HTTPSampler.response_timeout">5000</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP 更新core-svc配置" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;httpType&quot;: &quot;POST&quot;,&#xd;
  &quot;urlAddr&quot;: &quot;http://${coreIp}:${corePort}/bookDemo/core/practice/updateConfig&quot;,&#xd;
  &quot;arams&quot;: { &#xd;
    &quot;mysql_resp_interval&quot;: &quot;-1&quot;,&#xd;
    &quot;get_http_url1&quot;: &quot;http://${riskIp}:${riskPort}/bookDemo/risk/practice/httpTxn1&quot;,&#xd;
    &quot;get_http_url2&quot;: &quot;http://${rocketmqIp}:${rocketmqPort}/bookDemo/rocketmq/practice/httpSuccess&quot;,&#xd;
    &quot;get_http_url3&quot;: &quot;http://${rocketmqIp}:${rocketmqPort}/bookDemo/rocketmq/practice/httpSuccess&quot;,&#xd;
    &quot;get_http_url4&quot;: &quot;http://${rocketmqIp}:${rocketmqPort}/bookDemo/rocketmq/practice/httpSuccess&quot;,&#xd;
    &quot;http_error_resp_code&quot;: &quot;200&quot;,&#xd;
    &quot;http_resp_interval&quot;: &quot;15&quot;&#xd;
  }&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${ngIp}</stringProp>
          <stringProp name="HTTPSampler.port">${ngPort}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">bookDemo/chain/chainDTO</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.implementation">Java</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP 更新data-svc配置" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;httpType&quot;: &quot;POST&quot;,&#xd;
  &quot;urlAddr&quot;: &quot;http://${dataIp}:${dataPort}/bookDemo/data/practice/updateConfig&quot;,&#xd;
  &quot;arams&quot;: { &#xd;
    &quot;mysql_resp_interval&quot;: &quot;-1&quot;,&#xd;
    &quot;get_http_url1&quot;: &quot;http://${rocketmqIp}:${rocketmqPort}/bookDemo/rocketmq/practice/httpTxn1&quot;,&#xd;
    &quot;get_http_url2&quot;: &quot;http://${rocketmqIp}:${rocketmqPort}/bookDemo/rocketmq/practice/httpSuccess&quot;,&#xd;
    &quot;get_http_url3&quot;: &quot;http://${rocketmqIp}:${rocketmqPort}/bookDemo/rocketmq/practice/httpSuccess&quot;,&#xd;
    &quot;get_http_url4&quot;: &quot;http://${rocketmqIp}:${rocketmqPort}/bookDemo/rocketmq/practice/httpSuccess&quot;,&#xd;
    &quot;http_error_resp_code&quot;: &quot;200&quot;,&#xd;
    &quot;http_resp_interval&quot;: &quot;15&quot;&#xd;
  }&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${ngIp}</stringProp>
          <stringProp name="HTTPSampler.port">${ngPort}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">bookDemo/chain/chainDTO</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.implementation">Java</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP 更新risk-svc配置" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;httpType&quot;: &quot;POST&quot;,&#xd;
  &quot;urlAddr&quot;: &quot;http://${riskIp}:${riskPort}/bookDemo/risk/practice/updateConfig&quot;,&#xd;
  &quot;arams&quot;: { &#xd;
    &quot;mysql_resp_interval&quot;: &quot;-1&quot;,&#xd;
    &quot;get_http_url1&quot;: &quot;http://${dataIp}:${dataPort}/bookDemo/data/practice/httpTxn1&quot;,&#xd;
    &quot;get_http_url2&quot;: &quot;http://${rocketmqIp}:${rocketmqPort}/bookDemo/rocketmq/practice/httpSuccess&quot;,&#xd;
    &quot;get_http_url3&quot;: &quot;http://${rocketmqIp}:${rocketmqPort}/bookDemo/rocketmq/practice/httpSuccess&quot;,&#xd;
    &quot;get_http_url4&quot;: &quot;http://${rocketmqIp}:${rocketmqPort}/bookDemo/rocketmq/practice/httpSuccess&quot;,&#xd;
    &quot;http_error_resp_code&quot;: &quot;200&quot;,&#xd;
    &quot;http_resp_interval&quot;: &quot;15&quot;&#xd;
  }&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${ngIp}</stringProp>
          <stringProp name="HTTPSampler.port">${ngPort}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">bookDemo/chain/chainDTO</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.implementation">Java</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP 更新cron-svc配置" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;httpType&quot;: &quot;POST&quot;,&#xd;
  &quot;urlAddr&quot;: &quot;http://${cronIp}:${cronPort}/bookDemo/cron/practice/updateConfig&quot;,&#xd;
  &quot;arams&quot;: { &#xd;
    &quot;mysql_resp_interval&quot;: &quot;-1&quot;,&#xd;
    &quot;get_http_url1&quot;: &quot;http://${dataIp}:${dataPort}/bookDemo/data/practice/httpTxn1&quot;,&#xd;
    &quot;get_http_url2&quot;: &quot;http://${rocketmqIp}:${rocketmqPort}/bookDemo/rocketmq/practice/httpSuccess&quot;,&#xd;
    &quot;get_http_url3&quot;: &quot;http://${rocketmqIp}:${rocketmqPort}/bookDemo/rocketmq/practice/httpSuccess&quot;,&#xd;
    &quot;get_http_url4&quot;: &quot;http://${rocketmqIp}:${rocketmqPort}/bookDemo/rocketmq/practice/httpSuccess&quot;,&#xd;
    &quot;http_error_resp_code&quot;: &quot;200&quot;,&#xd;
    &quot;http_resp_interval&quot;: &quot;15&quot;&#xd;
  }&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${ngIp}</stringProp>
          <stringProp name="HTTPSampler.port">${ngPort}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">bookDemo/chain/chainDTO</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.implementation">Java</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP 更新rocketmq配置" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;httpType&quot;: &quot;POST&quot;,&#xd;
  &quot;urlAddr&quot;: &quot;http://${rocketmqIp}:${rocketmqPort}/bookDemo/rocketmq/practice/updateConfig&quot;,&#xd;
  &quot;arams&quot;: { &#xd;
    &quot;mysql_resp_interval&quot;: &quot;-1&quot;,&#xd;
    &quot;get_http_url1&quot;: &quot;http://${rocketmqIp}:${rocketmqPort}/bookDemo/http/creatBlockHttpStatus?statusCode=200&amp;blockTime=500&quot;,&#xd;
    &quot;get_http_url2&quot;: &quot;http://${rocketmqIp}:${rocketmqPort}/bookDemo/rocketmq/practice/httpSuccess&quot;,&#xd;
    &quot;get_http_url3&quot;: &quot;http://${rocketmqIp}:${rocketmqPort}/bookDemo/rocketmq/practice/httpSuccess&quot;,&#xd;
    &quot;get_http_url4&quot;: &quot;http://${rocketmqIp}:${rocketmqPort}/bookDemo/rocketmq/practice/httpSuccess&quot;,&#xd;
    &quot;http_error_resp_code&quot;: &quot;200&quot;,&#xd;
    &quot;http_resp_interval&quot;: &quot;15&quot;&#xd;
  }&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${ngIp}</stringProp>
          <stringProp name="HTTPSampler.port">${ngPort}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">bookDemo/chain/chainDTO</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.implementation">Java</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="聚合报告" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="察看结果树" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="start" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="循环控制器" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="业务链路2" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="用户定义的变量" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${ngIp}</stringProp>
          <stringProp name="HTTPSampler.port">${ngPort}</stringProp>
          <stringProp name="HTTPSampler.path">bookDemo/ng/practice/httpTxn1</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.implementation">Java</stringProp>
          <stringProp name="HTTPSampler.connect_timeout">15000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">30000</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="察看结果树" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="聚合报告" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="察看结果树" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>